share/tutorials/incompressible/dym-pimple/moving_cone/constant/dynamicMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      dynamicMeshDict;
}

dynamicFvMesh   dynamicMotionSolverFvMesh;
motionSolverLibs ( "libmousse_fv_motion_solvers.so" );
solver          velocityComponentLaplacian;
velocityComponentLaplacianCoeffs
{
  component       x;
  diffusivity     directional (1 200 0);
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
