share/tutorials/incompressible/dym-pimple/moving_cone/0/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  movingWall
  {
    type            zeroGradient;
  }
  farFieldMoving
  {
    type            zeroGradient;
  }
  fixedWall
  {
    type            zeroGradient;
  }
  left
  {
    type            totalPressure;
    p0              $internalField;
    U               U;
    phi             phi;
    rho             none;
    psi             none;
    gamma           1;
    value           uniform 0;
  }
  farField
  {
    type            zeroGradient;
  }
  back
  {
    type            wedge;
  }
  front
  {
    type            wedge;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
