share/tutorials/incompressible/dym-pimple/moving_cone/0/pointMotionUx
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       pointScalarField;
  object      pointMotionU;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  movingWall
  {
    type            uniformFixedValue;
    uniformValue    constant 1;
  }
  farFieldMoving
  {
    type            slip;
  }
  fixedWall
  {
    type            uniformFixedValue;
    uniformValue    constant 0;
  }
  left
  {
    type            uniformFixedValue;
    uniformValue    constant 0;
  }
  farField
  {
    type            slip;
  }
  back
  {
    type            wedge;
  }
  front
  {
    type            wedge;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
