share/tutorials/incompressible/dym-pimple/moving_cone/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      Gauss linear;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
  laplacian(diffusivity,cellMotionU) Gauss linear uncorrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
