share/tutorials/incompressible/dym-pimple/moving_cone/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       0;
    relTol          0.01;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration no;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  pFinal
  {
    $p;
    tolerance       1e-06;
    relTol          0;
  }
  pcorr
  {
    $p
    tolerance       0.02;
    relTol          0;
  }
  U
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0.1;
  }
  UFinal
  {
    $U;
    tolerance       1e-05;
    relTol          0;
  }
  cellMotionUx
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-08;
    relTol          0;
  }
}
PIMPLE
{
  correctPhi          yes;
  nOuterCorrectors    2;
  nCorrectors         1;
  nNonOrthogonalCorrectors 0;
}
relaxationFactors
{
  equations
  {
    "U.*"           1;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
