share/tutorials/incompressible/dym-pimple/moving_cone/system/cuttingPlane

cuttingPlane
{
    type            surfaces;
    functionObjectLibs ("libmousse_sampling.so");

    outputControl   outputTime;

    surfaceFormat   vtk;
    fields          ( p U );

    interpolationScheme cellPoint;

    surfaces
    (
        zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                basePoint       (0 0 0);
                normalVector    (0 0 1);
            }
            interpolate     true;
        }
    );
}

